; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	image0 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	Star2 - direction
	Star4 - direction
	Star0 - direction
	Star3 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(supports instrument1 image0)
	(calibration_target instrument1 Star3)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument3 spectrograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 spectrograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument5 image0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star2)
	(supports instrument7 spectrograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon6)
	(supports instrument8 spectrograph1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star0)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 Star3)
	(supports instrument10 spectrograph1)
	(supports instrument10 image0)
	(calibration_target instrument10 Star3)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star13)
)
(:goal (and
	(pointing satellite2 Star4)
	(have_image Phenomenon5 image0)
	(have_image Phenomenon6 image0)
	(have_image Phenomenon7 image0)
	(have_image Planet8 image0)
	(have_image Star9 image0)
	(have_image Planet10 image0)
	(have_image Planet11 spectrograph1)
	(have_image Planet12 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Planet14 image0)
))

)

; plan
1. (turn_to satellite2 star4 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star4)
   goals met: 1 of 11
2. (turn_to satellite0 groundstation1 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 11
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 11
4. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 11
5. (turn_to satellite0 planet11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet11)
   goals met: 1 of 11
6. (take_image satellite0 planet11 instrument2 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 2 of 11
7. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 2 of 11
8. (take_image satellite0 planet10 instrument2 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 11
9. (turn_to satellite0 phenomenon7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 11
10. (take_image satellite0 phenomenon7 instrument2 image0)
   added: (have_image phenomenon7 image0)
   goals met: 4 of 11
11. (turn_to satellite0 phenomenon6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 11
12. (take_image satellite0 phenomenon6 instrument2 image0)
   added: (have_image phenomenon6 image0)
   goals met: 5 of 11
13. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 5 of 11
14. (take_image satellite0 phenomenon5 instrument2 image0)
   added: (have_image phenomenon5 image0)
   goals met: 6 of 11
15. (turn_to satellite0 planet12 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet12)
   goals met: 6 of 11
16. (take_image satellite0 planet12 instrument2 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 7 of 11
17. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 7 of 11
18. (take_image satellite0 planet14 instrument2 image0)
   added: (have_image planet14 image0)
   goals met: 8 of 11
19. (turn_to satellite0 planet8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet8)
   goals met: 8 of 11
20. (take_image satellite0 planet8 instrument2 image0)
   added: (have_image planet8 image0)
   goals met: 9 of 11
21. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 9 of 11
22. (take_image satellite0 star13 instrument2 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 10 of 11
23. (turn_to satellite0 star9 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star9)
   goals met: 10 of 11
24. (take_image satellite0 star9 instrument2 image0)
   added: (have_image star9 image0)
   goals met: 11 of 11
